{
  "projects": [
    {
      "id": "e-certificate",
      "type": "Web Platform",
      "title": "E-Certificate Issuance Web platform",
      "technologies": ["Vue", "TypeScript", "NodeJS", "MySQL", "Cloudinary", "Hostinger", "Vercel"],
      "year": "March, 2025",
      "role": "Full stack Developer",
      "member": "2 Developers",
      "demoUrl": "#",
      "sourceUrl": "#",
      "designUrl": "#",
      "hiddenSections": ["Security", "Impact & Reflection"],
      "hideLinks": true,
      "topImage": "/assets/certificate-hero.png",
      "sections": {
        "product-overview": {
          "heading": "Digital Certificate Generation & Sharing System",
          "body": [
            "Developed an online certificate issuance system that allows students to instantly receive and share their certificates digitally.",
            "Each certificate includes a QR code, which redirects users to a public certificate verification page, enabling students to share verified certificates on platforms like LinkedIn, Facebook, and X (Twitter)."
          ],
          "image": "/assets/certificate-preview.png",
          "keyFeatures": [
            { "title": "Instant Generation", "description": "Client-side PDF rendering ensures zero server wait time." },
            { "title": "Verification", "description": "Each certificate includes a unique QR code linked to a persistent public URL." },
            { "title": "Social Sharing", "description": "Optimized Open Graph tags allow beautiful previews on platforms like Facebook and LinkedIn." },
            { "title": "Secure Storage", "description": "Digital assets are stored in Cloudinary, while metadata is secured in MySQL." }
          ]
        },
        "system-design": {
          "body": [],
          "image": "/assets/certificate-issuance-platform.png",
          "numberedItems": [
            {
              "title": "Server Orchestration (Express.js)",
              "description": "The server acts as a secure middleware. It receives the payload and splits the data stream:",
              "subPoints": [
                "Assets: The image is uploaded to Cloudinary via upload streams.",
                "Metadata: Essential records (Student ID, Issue Date, Image URL) are stored in MySQL."
              ]
            },
            {
              "title": "Dynamic Delivery & Verification",
              "description": "",
              "subPoints": [
                "Public Access: Each certificate gets a unique, verifiable URL (/api/certificates/:id.jpg).",
                "QR Verification: Scanning the QR code leads to a persistent verification page hosted on the client."
              ]
            },
            {
              "title": "Social Sharing Optimization",
              "description": "A dedicated server-side route handles Open Graph (OG) tag injection. This ensures that crawlers from LinkedIn, Facebook, and X (Twitter) can correctly fetch and display the certificate preview image, bridging the gap between SPA architecture and social bots."
            }
          ],
          "heading": "1. Tech stack",
          "techStackBody": [
            "Why Vue3?:",
            "Optimized for Dashboard UX (SPA Architecture) The primary function of this application is an Admin Dashboard for school officers. Unlike public content sites, admin panels require a snappy, app-like experience. Vue's SPA architecture ensures that once the initial application is loaded, all subsequent operations are extremely fast with zero page reloads. This performance is ideal for the highly interactive UI required in a management environment.",
            "High Productivity with Forms (Two-Way Binding) Certificate generation involves complex data entry and validation. Vue's two-way data binding (v-model) significantly reduces boilerplate code compared to React's one-way data flow. This allowed me to build and iterate on the complex form logic much faster.",
            "Pragmatic Problem Solving (Avoiding Over-engineering) While frameworks like Next.js offer built-in SEO solutions, migrating the entire application just for the \"Social Media Share\" feature would have been over-engineering. Instead, I maintained the agility of Vue for the frontend and implemented a targeted backend solution (Express) for the specific OG tag requirement, balancing development efficiency with functional requirements."
          ],
          "techStackSections": [
            {
              "title": "Frontend",
              "items": [
                "Framework: Vue 3 (Composition API) + TypeScript",
                "Build Tool: Vite",
                "Styling: Tailwind CSS, Tailwind Merge, Tailwind Animate",
                "Routing: Vue Router",
                "Form Handling: Zod, Vue Hook Form Resolver",
                "PDF / Certificate Rendering: PDF-lib, html2canvas, jsPDF",
                "Charts & Visualization: Chart.js, Vue Chart.js, Chart.js Plugin Datalabels, Recharts",
                "Utilities: VueUse, Date-fns, Axios, QRCode, Quill, Vue3-Toastify"
              ]
            },
            {
              "title": "Backend",
              "items": [
                "Runtime / Framework: Express.js (TypeScript)",
                "Database: MySQL",
                "File Uploads: Multer",
                "Cloud Storage: Cloudinary",
                "PDF/Image Conversion: Cloudinary upload streams",
                "Environment Management: dotenv",
                "CORS: cors (Cross-Origin Resource Sharing)"
              ]
            },
            {
              "title": "Development & Tooling",
              "items": [
                "Language: TypeScript",
                "Dev Tools: ts-node, tsx, Vite, Vue TSC",
                "Version Control & CI/CD: GitHub Actions",
                "Deployment:",
                "Server: Vercel",
                "Client: Hostinger",
                "Media Storage: Cloudinary",
                "Legacy Data Source: WordPress (student info API integration)"
              ]
            }
          ]
        },
        "process": {
          "body": [],
          "image": "/assets/certificate-flowchart.png",
          "imageTitle": "End-to-End User Workflow",
          "imageBelowFirst": "/assets/architecture-diagram.png",
          "imageBelowFirstTitle": "Full-Stack Implementation Overview"
        },
        "constraints--trade-offs": {
          "body": [],
          "processBlocks": [
            {
              "title": "1. Blob-to-JPEG Conversion in a Serverless Environment",
              "subsections": [
                {
                  "heading": "Challenge:",
                  "items": [
                    {
                      "title": "1-1. Converting PDF to JPEG using Poppler",
                      "body": "Converting PDF blobs to JPEG in a serverless environment (Vercel) was challenging. Initial attempt using Poppler (node-poppler) failed because Vercel does not support native binaries (.so, .dll), making it unsuitable for a serverless environment."
                    },
                    {
                      "title": "1-2. Generating the Bachelor of International Tourism certificate with CSS",
                      "body": "A second attempt used CSS for the diploma layout and Puppeteer (a Node.js library for headless Chrome) to convert styled HTML to PDF. PDF generation worked but the rendered images appeared blurry and pixelated in the browser, making it unsuitable for production."
                    }
                  ]
                },
                {
                  "heading": "Solution:",
                  "body": [
                    "Conversion was moved to the frontend using PDF-lib and Canvas to generate a Base64 image, which was then uploaded to Cloudinary as a JPEG via the Express API. This removed native dependencies and ensured compatibility with Vercel's serverless runtime."
                  ],
                  "imageSrc": "/assets/blob-to-jpeg-diagram.png"
                }
              ]
            },
            {
              "title": "2. Optimizing File Upload Workflow After Conversion",
              "subsections": [
                {
                  "heading": "Challenge:",
                  "body": [
                    "Initially, I planned to upload the generated image to the WordPress Media API, since all student data was stored in WordPress. However, direct upload attempts from the Express server consistently failed due to CORS and authentication restrictions."
                  ]
                },
                {
                  "heading": "Solution:",
                  "body": [
                    "I switched to Cloudinary, which provides a reliable and developer-friendly API for direct uploads. Using cloudinary.uploader.upload_stream(), I could efficiently upload the converted certificate image and receive a public URL for display. This allowed seamless integration with both the backend (phpMyAdmin) and frontend certificate page."
                  ],
                  "imageSrc": "/assets/process-upload-cloudinary.png"
                }
              ]
            },
            {
              "title": "3. Implementing Server-Side OG Tag Rendering for Facebook Previews",
              "subsections": [
                {
                  "heading": "Challenge:",
                  "body": [
                    "While LinkedIn and X correctly displayed link previews, Facebook failed to render the certificate image. This occurred because the application is a Vue.js SPA, where Open Graph (OG) meta tags are injected client-side via JavaScript. Facebook's crawler does not execute JavaScript, meaning it only saw the initial empty HTML shell without the necessary metadata."
                  ]
                },
                {
                  "heading": "Solution:",
                  "body": [
                    "I implemented a server-side rendering strategy for OG tags. I created a dedicated backend route (e.g., /api/certificates/share/:id) that generates and serves static HTML containing the pre-populated og:image, og:title, and og:description tags.",
                    "For Crawlers: When Facebook requests this URL, it receives static HTML with the correct Cloudinary image link instantly, allowing the preview to render.",
                    "For Users: Clicking the preview redirects the user to the actual interactive Vue application.",
                    "This approach bridged the gap between the serverless Vue frontend and legacy crawler behaviors without needing a full-scale SSR framework like Nuxt.js."
                  ],
                  "imageSrc": "/assets/facebook-og-preview.png"
                }
              ]
            }
          ]
        },
        "performance--accessibility": {
          "body": [
            "Optimized certificate generation to minimize image size without losing clarity.",
            "Ensured all interactive elements (buttons, QR, inputs) meet accessibility color-contrast and keyboard navigation standards."
          ]
        },
        "impact-reflection": {
          "body": [
            "This project deepened my understanding of compatibility between cloud platforms and libraries, especially regarding native binaries. I also gained hands-on experience in:",
            "Debugging style inheritance conflicts across frameworks.",
            "Managing multi-environment deployments (Vercel + Hostinger + WordPress data).",
            "Strengthening troubleshooting skills for complex full-stack integrations."
          ]
        },
        "testing--ci/cd": {
          "body": [
            "Implemented GitHub Actions for automated deployment and build checks.",
            "Server: Deployed via Vercel",
            "Client: Hosted on Hostinger",
            "Data: Fetched dynamically from existing WordPress datasets"
          ]
        },
        "next-steps": {
          "body": [
            "Evaluate backend-side libraries before deployment to ensure compatibility with the target cloud platform (e.g., AWS Lambda, Vercel).",
            "Explore image generation using serverless functions for better performance and reliability."
          ]
        },
        "key-learnings": {
          "body": [
            "Integrated WordPress data with a custom certificate platform.",
            "Learned how library behavior varies depending on the cloud platform environment.",
            "Strengthened practical understanding of frontend–backend–cloud interoperability."
          ]
        }
      }
    },
    {
      "id": "dynamic-cms",
      "type": "Dynamic Website",
      "title": "Dynamic CMS-Driven Website",
      "technologies": ["Nextjs", "Convex", "TypeScript", "TailwindCSS", "Convex"],
      "year": "Dec 24",
      "role": "Full stack Developer",
      "member": "2 Developers",
      "demoUrl": "#",
      "sourceUrl": "#",
      "designUrl": "#"
    },
    {
      "id": "marketing-analytics",
      "type": "Dynamic Website",
      "title": "Marketing Analytics Website",
      "technologies": ["Vue", "TypeScript", "PostgreSQL", "Strapi", "Cloudinary"],
      "year": "Dec 24",
      "role": "Full stack Developer",
      "member": "2 Developers",
      "demoUrl": "#",
      "sourceUrl": "#",
      "designUrl": "#"
    },
    {
      "id": "wordpress-hubspot",
      "type": "CMS",
      "title": "Custom WordPress Website (HubSpot + Custom CSS)",
      "technologies": ["WordPress", "Elementor", "HubSpot", "Custom CSS"],
      "year": "Dec 24",
      "role": "Full stack Developer",
      "member": "2 Developers",
      "demoUrl": "#",
      "sourceUrl": "#",
      "designUrl": "#"
    }
  ],
  "detailSections": [
    "Product Overview",
    "Process",
    "System Design",
    "Constraints & Trade-offs",
    "Performance & Accessibility",
    "Testing & CI/CD",
    "Security",
    "Impact & Reflection",
    "Next Steps",
    "Key Learnings"
  ]
}
